/^\d\d$/ // починається з цифр макс дві
/^20\d\d$/  // має бути
/^\D$/ // любий символ але не цифра
^ // має починатися з того що вказано
/\w/ // a-Z _ 0-9
/\W/ // все крім a-Z - 0-9
/\s/ // tab, probel
/\S/ // все крім tab, probel
/.../ // . любий символ
/\./ // крапка
/^[М,К,Д,С]аша$/ // масив з допустимих букв, регістро залежні
/[a-z,A-Z]/
/[^a-z,A-Z]/ // Любий символ крім указаних
/^\d{4}$/	// мета-символи повторення
/^\d{4,}$/	// мета-символи повторення 4 і більше {2-4} min-max
/\d.?/ // ? - попередній символ не обов'язковий
/\d.+/ // + як мінімум один раз
/\d.*/ // * попередній символ може бути, може не бути, а може бути декілька разів
/^(\+38)?$/ // ? - знак до дужок
/^ 333 (-|_)?222/	
/^\+?(38)?\s?\(?0\d\d\)?( |-)?(\d(-| )?){6}\d$/ // проверка телефон